# M5 COMPETITION: PART 3: ML

## 1. IMPORT

In [39]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt

import seaborn as sns

from plotly import tools, subplots
import plotly.graph_objs as go
import plotly.express as px

from pandas.plotting import scatter_matrix

from IPython.display import display

from catboost import CatBoostRegressor, Pool

from sklearn.model_selection import train_test_split

## 2. READ DATA

In [40]:
calendar_df = pd.read_csv('calendar.csv')

sell_prices_df = pd.read_csv('sell_prices.csv')

data_df = pd.read_csv('data.csv')

## 3. DATA WRANGLING

In [41]:
print('Size of calendar_df data is: ', calendar_df.shape)
print('Size of data_df data is: ', data_df.shape)
print('Size of sell_prices_df data is: ', sell_prices_df.shape)

Size of calendar_df data is:  (1969, 14)
Size of data_df data is:  (1969, 19)
Size of sell_prices_df data is:  (6841121, 4)

### 3.1 Calendar_df

In [42]:
calendar_df.head()

,date,wm_yr_wk,weekday,wday,month,year,d,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI
0,2011-01-29,11101,Saturday,1,1,2011,d_1,NaN,NaN,NaN,NaN,0,0,0
1,2011-01-30,11101,Sunday,2,1,2011,d_2,NaN,NaN,NaN,NaN,0,0,0
2,2011-01-31,11101,Monday,3,1,2011,d_3,NaN,NaN,NaN,NaN,0,0,0
3,2011-02-01,11101,Tuesday,4,2,2011,d_4,NaN,NaN,NaN,NaN,1,1,0
4,2011-02-02,11101,Wednesday,5,2,2011,d_5,NaN,NaN,NaN,NaN,1,0,1

In [43]:
calendar_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1969 entries, 0 to 1968
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          1969 non-null   object
 1   wm_yr_wk      1969 non-null   int64
 2   weekday       1969 non-null   object
 3   wday          1969 non-null   int64
 4   month         1969 non-null   int64
 5   year          1969 non-null   int64
 6   d             1969 non-null   object
 7   event_name_1  162 non-null    object
 8   event_type_1  162 non-null    object
 9   event_name_2  5 non-null      object
 10  event_type_2  5 non-null      object
 11  snap_CA       1969 non-null   int64
 12  snap_TX       1969 non-null   int64
 13  snap_WI       1969 non-null   int64
dtypes: int64(7), object(7)
memory usage: 215.5+ KB

In [44]:
#Missing Values

total_values = calendar_df.isnull().sum().sort_values(ascending = False)
percentage = (calendar_df.isnull().sum()/calendar_df.isnull().count()*100).sort_values(ascending = False)

missing_calendar = pd.concat([total_values, percentage], axis = 1, keys = ['Total Values', 'Percentage'])
missing_calendar

              Total Values  Percentage
event_name_2          1964   99.746064
event_type_2          1964   99.746064
event_name_1          1807   91.772473
event_type_1          1807   91.772473
date                     0    0.000000
wm_yr_wk                 0    0.000000
weekday                  0    0.000000
wday                     0    0.000000
month                    0    0.000000
year                     0    0.000000
d                        0    0.000000
snap_CA                  0    0.000000
snap_TX                  0    0.000000
snap_WI                  0    0.000000

### 3.2 sell_prices_df

In [45]:
sell_prices_df.head(1000)

    store_id        item_id  wm_yr_wk  sell_price
0       CA_1  HOBBIES_1_001     11325        9.58
1       CA_1  HOBBIES_1_001     11326        9.58
2       CA_1  HOBBIES_1_001     11327        8.26
3       CA_1  HOBBIES_1_001     11328        8.26
4       CA_1  HOBBIES_1_001     11329        8.26
..       ...            ...       ...         ...
995     CA_1  HOBBIES_1_005     11437        2.88
996     CA_1  HOBBIES_1_005     11438        2.88
997     CA_1  HOBBIES_1_005     11439        2.88
998     CA_1  HOBBIES_1_005     11440        2.88
999     CA_1  HOBBIES_1_005     11441        2.88

[1000 rows x 4 columns]

In [46]:
sell_prices_df.item_id.value_counts()

FOODS_3_587        2820
HOUSEHOLD_1_177    2820
HOUSEHOLD_2_283    2820
HOBBIES_1_337      2820
FOODS_1_032        2820
                   ...
HOUSEHOLD_1_308     642
HOUSEHOLD_1_159     623
HOUSEHOLD_1_242     600
FOODS_3_296         592
FOODS_2_379         530
Name: item_id, Length: 3049, dtype: int64

In [47]:
sell_prices_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6841121 entries, 0 to 6841120
Data columns (total 4 columns):
 #   Column      Dtype
---  ------      -----
 0   store_id    object
 1   item_id     object
 2   wm_yr_wk    int64
 3   sell_price  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 208.8+ MB

In [48]:
total_values = sell_prices_df.isnull().sum().sort_values(ascending = False)
percentage = (sell_prices_df.isnull().sum()/sell_prices_df.isnull().count()*100).sort_values(ascending = False)

missing_sell_prices = pd.concat([total_values, percentage], axis = 1, keys = ['Total Values', 'Percentage'])
missing_sell_prices

            Total Values  Percentage
store_id               0         0.0
item_id                0         0.0
wm_yr_wk               0         0.0
sell_price             0         0.0

### 3.3 data_df

In [49]:
data_df.head(100)

,date,Hobbies_CA_1,Household_1_CA_1,Household_2_CA_1,Foods_1_CA_1,Foods_2_CA_1,Foods_3_CA_1,Hobbies_CA_2,Household_1_CA_2,Household_2_CA_2,Foods_1_CA_2,Foods_2_CA_2,Foods_3_CA_2,Hobbies_CA_3,Household_1_CA_3,Household_2_CA_3,Foods_1_CA_3,Foods_2_CA_3,Foods_3_CA_3
0,2011-01-29,389,105,114,208,305,1799,374,169,143,63,274,1260,383,160,176,188,307,2029
1,2011-01-30,381,104,110,210,347,1808,238,152,154,47,209,1066,310,200,204,240,341,2035
2,2011-01-31,314,96,77,117,153,1118,238,105,97,39,123,759,271,168,148,183,278,1535
3,2011-02-01,303,90,66,122,183,1265,233,84,92,49,130,904,309,174,160,185,337,1900
4,2011-02-02,184,59,77,109,209,1217,198,73,104,20,112,787,233,141,150,162,290,1699
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,2011-05-04,236,84,52,111,158,1116,152,101,85,42,98,697,288,191,132,183,253,1478
96,2011-05-05,348,85,62,102,134,894,162,90,92,53,110,687,243,166,128,178,233,1498
97,2011-05-06,285,80,78,178,189,1204,244,112,120,42,128,773,319,190,144,193,258,1501
98,2011-05-07,395,170,105,163,234,1456,228,187,138,46,140,805,289,239,144,244,252,1678
99,2011-05-08,327,129,90,105,180,1186,258,157,161,66,142,855,373,177,160,225,282,1584

We need to transform the dataset in order to make it usable ! we must blend all the 19 Object per Store into one row, and the following for each date. The function pd.melt provide such a solution.

In [50]:
data_melt_df = pd.melt(data_df, id_vars = ['date'], value_vars = ['Hobbies_CA_1', 'Household_1_CA_1', 'Household_2_CA_1', 'Foods_1_CA_1', 'Foods_2_CA_1', 'Foods_3_CA_1', 'Hobbies_CA_2', 'Household_1_CA_2', 'Household_2_CA_2', 'Foods_1_CA_2', 'Foods_2_CA_2', 'Foods_3_CA_2', 'Hobbies_CA_3', 'Household_1_CA_3', 'Household_2_CA_3', 'Foods_1_CA_3', 'Foods_2_CA_3', 'Foods_3_CA_3'], ignore_index = False)
data_melt_df

            date      variable  value
0     2011-01-29  Hobbies_CA_1    389
1     2011-01-30  Hobbies_CA_1    381
2     2011-01-31  Hobbies_CA_1    314
3     2011-02-01  Hobbies_CA_1    303
4     2011-02-02  Hobbies_CA_1    184
...          ...           ...    ...
1964  2016-06-15  Foods_3_CA_3   1796
1965  2016-06-16  Foods_3_CA_3   1850
1966  2016-06-17  Foods_3_CA_3   2029
1967  2016-06-18  Foods_3_CA_3   2443
1968  2016-06-19  Foods_3_CA_3   2385

[35442 rows x 3 columns]

In [51]:
data_melt_df = data_melt_df.sort_index()

In [52]:
data_melt_df[data_melt_df['date'] == '2011-01-29']

         date          variable  value
0  2011-01-29      Hobbies_CA_1    389
0  2011-01-29      Foods_1_CA_1    208
0  2011-01-29      Foods_2_CA_1    305
0  2011-01-29      Foods_3_CA_3   2029
0  2011-01-29      Foods_3_CA_1   1799
0  2011-01-29      Hobbies_CA_2    374
0  2011-01-29  Household_1_CA_2    169
0  2011-01-29  Household_2_CA_1    114
0  2011-01-29  Household_2_CA_2    143
0  2011-01-29      Foods_2_CA_3    307
0  2011-01-29      Foods_2_CA_2    274
0  2011-01-29      Foods_3_CA_2   1260
0  2011-01-29      Hobbies_CA_3    383
0  2011-01-29  Household_1_CA_3    160
0  2011-01-29  Household_2_CA_3    176
0  2011-01-29      Foods_1_CA_2     63
0  2011-01-29  Household_1_CA_1    105
0  2011-01-29      Foods_1_CA_3    188

In [53]:
data_melt_df.head(30)

         date          variable  value
0  2011-01-29      Hobbies_CA_1    389
0  2011-01-29      Foods_1_CA_1    208
0  2011-01-29      Foods_2_CA_1    305
0  2011-01-29      Foods_3_CA_3   2029
0  2011-01-29      Foods_3_CA_1   1799
0  2011-01-29      Hobbies_CA_2    374
0  2011-01-29  Household_1_CA_2    169
0  2011-01-29  Household_2_CA_1    114
0  2011-01-29  Household_2_CA_2    143
0  2011-01-29      Foods_2_CA_3    307
0  2011-01-29      Foods_2_CA_2    274
0  2011-01-29      Foods_3_CA_2   1260
0  2011-01-29      Hobbies_CA_3    383
0  2011-01-29  Household_1_CA_3    160
0  2011-01-29  Household_2_CA_3    176
0  2011-01-29      Foods_1_CA_2     63
0  2011-01-29  Household_1_CA_1    105
0  2011-01-29      Foods_1_CA_3    188
1  2011-01-30      Hobbies_CA_1    381
1  2011-01-30  Household_1_CA_3    200
1  2011-01-30      Foods_3_CA_3   2035
1  2011-01-30  Household_2_CA_1    110
1  2011-01-30      Foods_3_CA_1   1808
1  2011-01-30      Foods_3_CA_2   1066
1  2011-01-30  Household_2_CA_3    204
1  2011-01-30  Household_1_CA_2    152
1  2011-01-30      Foods_2_CA_2    209
1  2011-01-30  Household_1_CA_1    104
1  2011-01-30      Foods_2_CA_3    341
1  2011-01-30  Household_2_CA_2    154

Now we must create the feature 'store' (e.g: CA_1, CA_2, CA_3), ' and 'product (e.g: HOBBIES, HOUSEHOLD_1...)

In [54]:
#Match the store
data_melt_df['store'] = data_melt_df.variable.str.findall('CA_+[0-9]').str[0]

#Match the product
data_melt_df['product'] = data_melt_df.variable.str.findall('(.*?)\_CA').str[0]

In [55]:
data_melt_df = data_melt_df.drop(columns = ['variable'])
data_melt_df.head()

         date  value store  product
0  2011-01-29    389  CA_1  Hobbies
0  2011-01-29    208  CA_1  Foods_1
0  2011-01-29    305  CA_1  Foods_2
0  2011-01-29   2029  CA_3  Foods_3
0  2011-01-29   1799  CA_1  Foods_3

The data_df is properly transformed. We can pursue.

## 4. MERGING

Time to merge the data_melt_df with the calendar_df in order to get some features.

In [56]:
#Do a left join on ID 'date'.

data_merge_df = data_melt_df.merge(calendar_df, on = ['date'], how = 'left')
data_merge_df.head()

,date,value,store,product,wm_yr_wk,weekday,wday,month,year,d,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI
0,2011-01-29,389,CA_1,Hobbies,11101,Saturday,1,1,2011,d_1,NaN,NaN,NaN,NaN,0,0,0
1,2011-01-29,208,CA_1,Foods_1,11101,Saturday,1,1,2011,d_1,NaN,NaN,NaN,NaN,0,0,0
2,2011-01-29,305,CA_1,Foods_2,11101,Saturday,1,1,2011,d_1,NaN,NaN,NaN,NaN,0,0,0
3,2011-01-29,2029,CA_3,Foods_3,11101,Saturday,1,1,2011,d_1,NaN,NaN,NaN,NaN,0,0,0
4,2011-01-29,1799,CA_1,Foods_3,11101,Saturday,1,1,2011,d_1,NaN,NaN,NaN,NaN,0,0,0

In [57]:
#Here we replace the the nan values in events with 'no_events'. 
data_merge_df.fillna('no_events', inplace = True)

In [58]:
data_final = data_merge_df.drop(columns = ['date', 'd', 'wday'])
data_final.head()

,value,store,product,wm_yr_wk,weekday,month,year,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI
0,389,CA_1,Hobbies,11101,Saturday,1,2011,no_events,no_events,no_events,no_events,0,0,0
1,208,CA_1,Foods_1,11101,Saturday,1,2011,no_events,no_events,no_events,no_events,0,0,0
2,305,CA_1,Foods_2,11101,Saturday,1,2011,no_events,no_events,no_events,no_events,0,0,0
3,2029,CA_3,Foods_3,11101,Saturday,1,2011,no_events,no_events,no_events,no_events,0,0,0
4,1799,CA_1,Foods_3,11101,Saturday,1,2011,no_events,no_events,no_events,no_events,0,0,0

In [59]:
data_final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 35442 entries, 0 to 35441
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   value         35442 non-null  int64
 1   store         35442 non-null  object
 2   product       35442 non-null  object
 3   wm_yr_wk      35442 non-null  int64
 4   weekday       35442 non-null  object
 5   month         35442 non-null  int64
 6   year          35442 non-null  int64
 7   event_name_1  35442 non-null  object
 8   event_type_1  35442 non-null  object
 9   event_name_2  35442 non-null  object
 10  event_type_2  35442 non-null  object
 11  snap_CA       35442 non-null  int64
 12  snap_TX       35442 non-null  int64
 13  snap_WI       35442 non-null  int64
dtypes: int64(7), object(7)
memory usage: 4.1+ MB

In [60]:
#Transform the columns in their right categories.
cols = ['wm_yr_wk', 'month', 'year', 'snap_CA', 'snap_TX', 'snap_WI']
data_final[cols] = data_final[cols].astype(object)

In [61]:
data_final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 35442 entries, 0 to 35441
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   value         35442 non-null  int64
 1   store         35442 non-null  object
 2   product       35442 non-null  object
 3   wm_yr_wk      35442 non-null  object
 4   weekday       35442 non-null  object
 5   month         35442 non-null  object
 6   year          35442 non-null  object
 7   event_name_1  35442 non-null  object
 8   event_type_1  35442 non-null  object
 9   event_name_2  35442 non-null  object
 10  event_type_2  35442 non-null  object
 11  snap_CA       35442 non-null  object
 12  snap_TX       35442 non-null  object
 13  snap_WI       35442 non-null  object
dtypes: int64(1), object(13)
memory usage: 4.1+ MB

## 5. CATBOOST

In [62]:
y = data_final['value']
X = data_final.drop('value', axis = 1)

cat_features = np.where(X.dtypes == np.object)[0]

data = train_test_split(X, y, test_size = 0.20, random_state = 0)
X_train, X_validation, y_train, y_validation = data

train_pool = Pool(data = X_train, label = y_train, cat_features = cat_features)
validation_pool = Pool(data = X_validation, label = y_validation, cat_features = cat_features)

C:\Users\decom\AppData\Local\Temp/ipykernel_10868/2901673634.py:4: DeprecationWarning:

`np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations

In [66]:
cat = CatBoostRegressor(iterations=1000, depth=14, learning_rate = 0.1, verbose = 10, loss_function= 'RMSE', l2_leaf_reg=3, border_count = 254, one_hot_max_size = 400)

cat.fit(train_pool, eval_set = validation_pool, plot = True)

MetricVisualizer(layout=Layout(align_self='stretch', height='500px'))

0:	learn: 550.9100196	test: 557.8860295	best: 557.8860295 (0)	total: 48ms	remaining: 48s
10:	learn: 237.2467121	test: 238.2193407	best: 238.2193407 (10)	total: 1.53s	remaining: 2m 17s
20:	learn: 137.5912603	test: 140.4484551	best: 140.4484551 (20)	total: 3.53s	remaining: 2m 44s
30:	learn: 106.5265271	test: 112.6838248	best: 112.6838248 (30)	total: 5.72s	remaining: 2m 58s
40:	learn: 93.1400405	test: 101.5535310	best: 101.5535310 (40)	total: 8.17s	remaining: 3m 11s
50:	learn: 85.7084431	test: 95.6462166	best: 95.6462166 (50)	total: 10.6s	remaining: 3m 16s
60:	learn: 80.8103771	test: 91.9384958	best: 91.9384958 (60)	total: 13s	remaining: 3m 20s
70:	learn: 76.8823385	test: 89.7729039	best: 89.7729039 (70)	total: 15.7s	remaining: 3m 25s
80:	learn: 73.3988712	test: 87.2808769	best: 87.2808769 (80)	total: 18.2s	remaining: 3m 26s
90:	learn: 70.8879573	test: 85.7149657	best: 85.7149657 (90)	total: 20.6s	remaining: 3m 25s
100:	learn: 69.0165461	test: 84.4988863	best: 84.4988863 (100)	total: 23.1s	remaining: 3m 25s
110:	learn: 67.6082681	test: 83.8051352	best: 83.8051352 (110)	total: 25.5s	remaining: 3m 24s
120:	learn: 66.3366111	test: 83.0196003	best: 83.0196003 (120)	total: 27.9s	remaining: 3m 22s
130:	learn: 65.3665653	test: 82.3890392	best: 82.3890392 (130)	total: 30.8s	remaining: 3m 24s
140:	learn: 64.2236486	test: 81.8668742	best: 81.8668742 (140)	total: 33.8s	remaining: 3m 26s
150:	learn: 63.3368326	test: 81.3159342	best: 81.3159342 (150)	total: 36.5s	remaining: 3m 25s
160:	learn: 62.6205999	test: 80.9929710	best: 80.9929710 (160)	total: 39s	remaining: 3m 23s
170:	learn: 61.7975611	test: 80.4593479	best: 80.4593479 (170)	total: 41.4s	remaining: 3m 20s
180:	learn: 60.8400534	test: 80.0928115	best: 80.0928115 (180)	total: 43.8s	remaining: 3m 18s
190:	learn: 60.0676624	test: 79.6890311	best: 79.6890311 (190)	total: 46.2s	remaining: 3m 15s
200:	learn: 59.2614933	test: 79.3393835	best: 79.3393835 (200)	total: 48.8s	remaining: 3m 14s
210:	learn: 58.5175735	test: 78.9726423	best: 78.9726423 (210)	total: 51.4s	remaining: 3m 12s
220:	learn: 57.9042727	test: 78.7943442	best: 78.7943442 (220)	total: 54s	remaining: 3m 10s
230:	learn: 57.3129414	test: 78.5954382	best: 78.5954382 (230)	total: 56.9s	remaining: 3m 9s
240:	learn: 56.6408461	test: 78.3202990	best: 78.3202990 (240)	total: 59.4s	remaining: 3m 7s
250:	learn: 56.0697602	test: 78.0667399	best: 78.0667399 (250)	total: 1m 1s	remaining: 3m 3s
260:	learn: 55.4654684	test: 77.9085692	best: 77.9085692 (260)	total: 1m 3s	remaining: 3m
270:	learn: 54.9398642	test: 77.7658078	best: 77.7658078 (270)	total: 1m 6s	remaining: 2m 57s
280:	learn: 54.3776853	test: 77.5749980	best: 77.5749980 (280)	total: 1m 8s	remaining: 2m 55s
290:	learn: 53.8777846	test: 77.3472831	best: 77.3472831 (290)	total: 1m 10s	remaining: 2m 51s
300:	learn: 53.3333896	test: 77.1969861	best: 77.1969861 (300)	total: 1m 12s	remaining: 2m 49s
310:	learn: 52.9550006	test: 77.1086535	best: 77.1054785 (309)	total: 1m 15s	remaining: 2m 47s
320:	learn: 52.4640730	test: 76.9932575	best: 76.9932575 (320)	total: 1m 18s	remaining: 2m 45s
330:	learn: 52.0686087	test: 76.8734222	best: 76.8734222 (330)	total: 1m 20s	remaining: 2m 42s
340:	learn: 51.6482774	test: 76.7655157	best: 76.7655157 (340)	total: 1m 22s	remaining: 2m 40s
350:	learn: 51.0822996	test: 76.6336514	best: 76.6336514 (350)	total: 1m 25s	remaining: 2m 37s
360:	learn: 50.6195480	test: 76.4944565	best: 76.4944565 (360)	total: 1m 27s	remaining: 2m 34s
370:	learn: 50.1747592	test: 76.4169586	best: 76.4151288 (369)	total: 1m 29s	remaining: 2m 31s
380:	learn: 49.7415922	test: 76.2960362	best: 76.2960362 (380)	total: 1m 31s	remaining: 2m 28s
390:	learn: 49.2253736	test: 76.2093753	best: 76.2093753 (390)	total: 1m 33s	remaining: 2m 26s
400:	learn: 48.9150366	test: 76.1542806	best: 76.1540707 (399)	total: 1m 36s	remaining: 2m 23s
410:	learn: 48.5993101	test: 76.0885627	best: 76.0885627 (410)	total: 1m 37s	remaining: 2m 20s
420:	learn: 48.2846293	test: 76.0111110	best: 76.0111110 (420)	total: 1m 39s	remaining: 2m 17s
430:	learn: 47.9578350	test: 75.9605579	best: 75.9605579 (430)	total: 1m 42s	remaining: 2m 15s
440:	learn: 47.5216837	test: 75.8460198	best: 75.8460198 (440)	total: 1m 44s	remaining: 2m 12s
450:	learn: 47.1820243	test: 75.7771123	best: 75.7771123 (450)	total: 1m 46s	remaining: 2m 9s
460:	learn: 46.8900287	test: 75.7615743	best: 75.7572163 (457)	total: 1m 48s	remaining: 2m 7s
470:	learn: 46.5765701	test: 75.7344845	best: 75.7274228 (466)	total: 1m 51s	remaining: 2m 4s
480:	learn: 46.2559670	test: 75.6616604	best: 75.6542519 (479)	total: 1m 53s	remaining: 2m 2s
490:	learn: 45.9723120	test: 75.6212535	best: 75.6212535 (490)	total: 1m 55s	remaining: 1m 59s
500:	learn: 45.6670450	test: 75.5349543	best: 75.5349543 (500)	total: 1m 57s	remaining: 1m 56s
510:	learn: 45.3385512	test: 75.4697699	best: 75.4697699 (510)	total: 1m 59s	remaining: 1m 54s
520:	learn: 44.9600168	test: 75.4181423	best: 75.4181423 (520)	total: 2m 1s	remaining: 1m 51s
530:	learn: 44.6106295	test: 75.3442473	best: 75.3442473 (530)	total: 2m 3s	remaining: 1m 48s
540:	learn: 44.3013642	test: 75.2985683	best: 75.2977085 (539)	total: 2m 5s	remaining: 1m 46s
550:	learn: 43.9663767	test: 75.2858219	best: 75.2641414 (548)	total: 2m 7s	remaining: 1m 43s
560:	learn: 43.6221453	test: 75.2270855	best: 75.2125592 (558)	total: 2m 9s	remaining: 1m 41s
570:	learn: 43.3242473	test: 75.1642128	best: 75.1642128 (570)	total: 2m 11s	remaining: 1m 38s
580:	learn: 43.0544496	test: 75.1176860	best: 75.1176860 (580)	total: 2m 13s	remaining: 1m 36s
590:	learn: 42.7860090	test: 75.0331383	best: 75.0291139 (589)	total: 2m 15s	remaining: 1m 33s
600:	learn: 42.5165415	test: 75.0086172	best: 75.0061803 (597)	total: 2m 17s	remaining: 1m 31s
610:	learn: 42.2893441	test: 74.9778051	best: 74.9778051 (610)	total: 2m 19s	remaining: 1m 28s
620:	learn: 42.0469952	test: 74.9216558	best: 74.9216558 (620)	total: 2m 21s	remaining: 1m 26s
630:	learn: 41.7449544	test: 74.8954312	best: 74.8753111 (628)	total: 2m 23s	remaining: 1m 23s
640:	learn: 41.4495321	test: 74.8647840	best: 74.8607069 (639)	total: 2m 25s	remaining: 1m 21s
650:	learn: 41.0778161	test: 74.8562093	best: 74.8517254 (646)	total: 2m 27s	remaining: 1m 18s
660:	learn: 40.8525557	test: 74.8350562	best: 74.8350562 (660)	total: 2m 29s	remaining: 1m 16s
670:	learn: 40.6203852	test: 74.8015232	best: 74.7944952 (668)	total: 2m 31s	remaining: 1m 14s
680:	learn: 40.3132502	test: 74.7241461	best: 74.7241461 (680)	total: 2m 33s	remaining: 1m 11s
690:	learn: 40.0898457	test: 74.6391526	best: 74.6384127 (688)	total: 2m 35s	remaining: 1m 9s
700:	learn: 39.8696823	test: 74.5897027	best: 74.5892628 (699)	total: 2m 37s	remaining: 1m 7s
710:	learn: 39.6579404	test: 74.5883393	best: 74.5875152 (706)	total: 2m 39s	remaining: 1m 4s
720:	learn: 39.4592479	test: 74.5554423	best: 74.5554423 (720)	total: 2m 41s	remaining: 1m 2s
730:	learn: 39.1729797	test: 74.4950738	best: 74.4950738 (730)	total: 2m 43s	remaining: 1m
740:	learn: 38.8828342	test: 74.4838995	best: 74.4759562 (738)	total: 2m 45s	remaining: 57.8s
750:	learn: 38.6698036	test: 74.4631620	best: 74.4631620 (750)	total: 2m 47s	remaining: 55.5s
760:	learn: 38.4875031	test: 74.4353372	best: 74.4353372 (760)	total: 2m 49s	remaining: 53.2s
770:	learn: 38.2910738	test: 74.4242281	best: 74.4232126 (768)	total: 2m 51s	remaining: 50.9s
780:	learn: 38.0877883	test: 74.3853990	best: 74.3853990 (780)	total: 2m 53s	remaining: 48.6s
790:	learn: 37.8321599	test: 74.3204298	best: 74.3204298 (790)	total: 2m 55s	remaining: 46.4s
800:	learn: 37.6386919	test: 74.2887254	best: 74.2887254 (800)	total: 2m 57s	remaining: 44.1s
810:	learn: 37.4274355	test: 74.2461925	best: 74.2461925 (810)	total: 2m 59s	remaining: 41.8s
820:	learn: 37.2344094	test: 74.2059805	best: 74.2059805 (820)	total: 3m 1s	remaining: 39.6s
830:	learn: 37.0445669	test: 74.1857144	best: 74.1845698 (829)	total: 3m 3s	remaining: 37.3s
840:	learn: 36.8583929	test: 74.1520924	best: 74.1520924 (840)	total: 3m 5s	remaining: 35.1s
850:	learn: 36.6278954	test: 74.1327924	best: 74.1325916 (847)	total: 3m 7s	remaining: 32.8s
860:	learn: 36.4226229	test: 74.0803582	best: 74.0803582 (860)	total: 3m 9s	remaining: 30.6s
870:	learn: 36.2455502	test: 74.0355150	best: 74.0355150 (870)	total: 3m 11s	remaining: 28.4s
880:	learn: 36.0767059	test: 74.0314373	best: 74.0286340 (876)	total: 3m 13s	remaining: 26.2s
890:	learn: 35.9001995	test: 73.9939025	best: 73.9939025 (890)	total: 3m 15s	remaining: 23.9s
900:	learn: 35.7284828	test: 73.9742903	best: 73.9742903 (900)	total: 3m 17s	remaining: 21.7s
910:	learn: 35.5726017	test: 73.9581633	best: 73.9581633 (910)	total: 3m 19s	remaining: 19.5s
920:	learn: 35.3243910	test: 73.9398273	best: 73.9358444 (919)	total: 3m 21s	remaining: 17.3s
930:	learn: 35.1000231	test: 73.9221097	best: 73.9221097 (930)	total: 3m 23s	remaining: 15.1s
940:	learn: 34.9300015	test: 73.8976093	best: 73.8976093 (940)	total: 3m 25s	remaining: 12.9s
950:	learn: 34.7383330	test: 73.8656625	best: 73.8637932 (949)	total: 3m 27s	remaining: 10.7s
960:	learn: 34.5507470	test: 73.8038759	best: 73.8038759 (960)	total: 3m 29s	remaining: 8.52s
970:	learn: 34.3751805	test: 73.7799890	best: 73.7788178 (969)	total: 3m 32s	remaining: 6.33s
980:	learn: 34.1887499	test: 73.7436875	best: 73.7422660 (978)	total: 3m 34s	remaining: 4.14s
990:	learn: 34.0418392	test: 73.7278494	best: 73.7250556 (988)	total: 3m 36s	remaining: 1.97s
999:	learn: 33.8891234	test: 73.7156656	best: 73.7156656 (999)	total: 3m 39s	remaining: 0us

bestTest = 73.71566562
bestIteration = 999